site.org
#+HUGO_BASE_DIR: .
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@


** Combinatorics
:PROPERTIES:
:EXPORT_FILE_NAME: combinatorics
:EXPORT_DATE: 2023-03-06
:ID:       d9bf37b1-8c13-4984-8448-adbf6f692b48
:END:

Combinatorics is the branch of mathematics that deals with counting and arranging objects.  We will cover some of the
fundamental concepts in combinatorics, including binomial coefficients, permutations, and derangements.

Binomial coefficients, also known as binomials, are a tool for counting the number of ways that a given set of objects
can be arranged or selected. We will explain how to calculate binomial coefficients  to model different scenarios such
as flipping coins or selecting items from a set.

A permutation is a reordering of a set of items.  We will explain how to count the number of permutations and how to
generate all the permutations of a given set. Derangements are permutations where no element appears in its original
position.  We will examine how to calculate the number of derangements for a set and discuss its applications.

*** Slides

- [[/slides/combinatorics.pdf][Combinatorics]]


